MITCHEL-Development/PEE51---AIRegelsysteem/FRDM-MCXN947/sdks/frdm_mcxn947_blank_sdk/devices/MCXN947/drivers/fsl_smartcard_uart.c
    return kStatus_SMARTCARD_Success;
}

/*!
 * brief This function disables the UART interrupts, disables the transmitter and receiver, and
 * flushes the FIFOs (for modules that support FIFOs) and gates UART clock in SIM.
 *
 * param base The UART peripheral base address.
 */
void SMARTCARD_UART_Deinit(UART_Type *base)
{
    assert(NULL != base);

    uint32_t instance          = 0u;
    IRQn_Type uart_irqs[]      = UART_RX_TX_IRQS;
    IRQn_Type uartError_irqs[] = UART_ERR_IRQS;
    /* In case there is still data in the TX FIFO or shift register that is
     * being transmitted wait till transmit is complete.
     * Wait until the data is completely shifted out of shift register */
    while (0u == ((base->S1 & UART_S1_TC_MASK) >> UART_S1_TC_SHIFT))
    {
    }

    base->C2 &= ~UART_C2_TIE_MASK;
#if defined(FSL_FEATURE_UART_IS_SCI) && (FSL_FEATURE_UART_IS_SCI)
    base->C4 &= ~UART_C4_TDMAS_MASK;
#else
    base->C5 &= ~UART_C5_TDMAS_MASK;
#endif
    base->C2 &= ~UART_C2_RIE_MASK;
#if defined(FSL_FEATURE_UART_IS_SCI) && (FSL_FEATURE_UART_IS_SCI)
    base->C4 &= ~UART_C4_RDMAS_MASK;
#else
    base->C5 &= ~UART_C5_RDMAS_MASK;
#endif
    /* Disable TX and RX */
    base->C2 &= (~UART_C2_TE_MASK & ~UART_C2_RE_MASK);
#if defined(FSL_FEATURE_UART_HAS_FIFO) && (FSL_FEATURE_UART_HAS_FIFO)
    /* Flush FIFO contents */
    base->CFIFO |= ((1u << UART_CFIFO_TXFLUSH_SHIFT) | (1u << UART_CFIFO_RXFLUSH_SHIFT));
#endif
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Disable UART module clock */
    CLOCK_DisableClock(s_uartClock[smartcard_uart_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    /* Disable the interrupt */
    instance = smartcard_uart_GetInstance(base);
    NVIC_DisableIRQ(uart_irqs[instance]);
    NVIC_DisableIRQ(uartError_irqs[instance]);
/* De-initialize also external PIT timer */
#if defined(FSL_FEATURE_PIT_TIMER_COUNT) && (FSL_FEATURE_PIT_TIMER_COUNT)
    smartcard_uart_TimerDeinit();
#endif
}

/*!
 * brief Returns whether the previous UART transfer has finished.
 *
 * When performing an async transfer, call this function to ascertain the context of the
 * current transfer: in progress (or busy) or complete (success). If the
 * transfer is still in progress, the user can obtain the number of words that have not been transferred
 * by reading xSize of smart card context structure.
 *
 * param base The UART peripheral base address.
 * param context A pointer to a Smart card driver context structure.
 *
 * return The number of bytes not transferred.
 */
int32_t SMARTCARD_UART_GetTransferRemainingBytes(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return -1;
    }

    if (context->xIsBusy)
    {
        if (context->direction == kSMARTCARD_Transmit)
        {
            /* Count of bytes in buffer + data in fifo + one now transmitted byte */
            return (context->xSize + base->TCFIFO + 1);
        }
        return context->xSize;
    }

    return 0;
}

/*!
 * brief Terminates an asynchronous UART transfer early.
 *
 * During an async UART transfer, the user can terminate the transfer early
 * if the transfer is still in progress.
 *
 * param base The UART peripheral base address.
 * param context A pointer to a Smart card driver context structure.
 *
 * retval kStatus_SMARTCARD_Success The transfer abort was successful.
 * retval kStatus_SMARTCARD_NoTransmitInProgress No transmission is currently in progress.
 */
status_t SMARTCARD_UART_AbortTransfer(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    context->abortTransfer = true;

    /* Check if a transfer is running. */
    if ((!context->xIsBusy))
    {
        return kStatus_SMARTCARD_NoTransferInProgress;
    }
    /* Call transfer complete to abort transfer */
    if (kSMARTCARD_Receive == context->direction)
    { /* Stop the running transfer. */
        smartcard_uart_CompleteReceiveData(base, context);
    }
    else if (kSMARTCARD_Transmit == context->direction)
    { /* Stop the running transfer. */
        smartcard_uart_CompleteSendData(base, context);
    }
    else
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    return kStatus_SMARTCARD_Success;
}

/*!
 * brief Transfers data using interrupts.
 *
 * A non-blocking (also known as asynchronous) function means that the function returns
 * immediately after initiating the transfer function. The application has to get the
 * transfer status to see when the transfer is complete. In other words, after calling non-blocking
 * (asynchronous) transfer function, the application must get the transfer status to check if transmit
 * is completed or not.
 *
 * param base The UART peripheral base address.
 * param context A pointer to a Smart card driver context structure.
 * param xfer A pointer to Smart card transfer structure where the linked buffers and sizes are stored.
 *
 * return An error code or kStatus_SMARTCARD_Success.
 */
status_t SMARTCARD_UART_TransferNonBlocking(UART_Type *base, smartcard_context_t *context, smartcard_xfer_t *xfer)
{
    if ((NULL == context) || (NULL == xfer) || (NULL == xfer->buff))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    /* Check input parameters */
    if ((0u == xfer->size))
    {
        return kStatus_SMARTCARD_Success;
    }
    /* Check if some transfer is in progress */
    if (0u != SMARTCARD_UART_GetTransferRemainingBytes(base, context))
    {
        if (kSMARTCARD_Receive == context->direction)
        {
            return kStatus_SMARTCARD_RxBusy;
        }
        else
        {
            return kStatus_SMARTCARD_TxBusy;
        }
    }
    /* Initialize error check flags */
    context->rxtCrossed  = false;
    context->txtCrossed  = false;
    context->parityError = false;
    /* Initialize SMARTCARD context structure to start transfer */
    context->xBuff = xfer->buff;
    context->xSize = xfer->size;

    if (kSMARTCARD_Receive == xfer->direction)
    {
        context->direction     = xfer->direction;
        context->transferState = kSMARTCARD_ReceivingState;
        /* Start transfer */
        smartcard_uart_StartReceiveData(base, context);
    }
    else if (kSMARTCARD_Transmit == xfer->direction)
    {
        context->direction     = xfer->direction;
        context->transferState = kSMARTCARD_TransmittingState;
        /* Start transfer */
        smartcard_uart_StartSendData(base, context);
    }
    else
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

