MITCHEL-Development/PEE51---AIRegelsysteem/FRDM-MCXN947/sdks/frdm_mcxn947_blank_sdk/devices/MCXN947/drivers/fsl_smartcard_uart.c
    return kStatus_SMARTCARD_Success;
}

/*!
 * brief Error interrupt handler for UART.
 *
 * This function handles error conditions during a transfer.
 *
 * param base The UART peripheral base address.
 * param context A pointer to a Smart card driver context structure.
 */
void SMARTCARD_UART_ErrIRQHandler(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return;
    }

    /* Check if a parity error occurred */
    if (base->S1 & UART_S1_PF_MASK)
    {
        if (kSMARTCARD_WaitingForTSState == context->transferState)
        {
            /* A parity error detected during initial character (TS) detection phase */
            context->transferState = kSMARTCARD_InvalidTSDetecetedState;
            /* Un-block any caller waiting for initial character detection */
            if ((context->xIsBusy) && (context->direction == kSMARTCARD_Receive))
            {
                smartcard_uart_CompleteReceiveData(base, context);
            }
        }
        else
        { /* Parity error detected after initial character detection phase */
            context->parityError = true;
            if (context->tType == kSMARTCARD_T0Transport)
            {
                smartcard_uart_CompleteReceiveData(base, context);
            }
        }
    }
    /* Check if Transmission threshold value was exceeded */
    if (base->IS7816 & UART_IS7816_TXT_MASK)
    { /* Disable transmitter */
        base->C2 &= ~UART_C2_TE_MASK;
        /* Clear Transmission threshold interrupt flag */
        base->IS7816 = UART_IS7816_TXT_MASK;
        /* Enable transmitter */
        base->C2 |= UART_C2_TE_MASK;
        context->txtCrossed = true;
        /* Disable the transmitter interrupt */
        base->C2 &= ~UART_C2_TIE_MASK;
        /* Flush tx fifo */
        base->CFIFO |= 0x80;
        /* Un-block the caller */
        smartcard_uart_CompleteSendData(base, context);
    }
    /* Check if Receiver threshold value was exceeded */
    if (base->IS7816 & UART_IS7816_RXT_MASK)
    {
        /* Clear Receiver threshold interrupt flag */
        base->IS7816 = UART_IS7816_RXT_MASK;
        /* Check if Receiver threshold was exceeded during initial character detection */
        if (kSMARTCARD_WaitingForTSState == context->transferState)
        {
            context->transferState = kSMARTCARD_InvalidTSDetecetedState;
            if ((context->xIsBusy) && (context->direction == kSMARTCARD_Receive))
            {
                smartcard_uart_CompleteReceiveData(base, context);
            }
        }
        else
        { /* Receiver threshold exceeded during normal transfer, set flags */
            context->rxtCrossed = true;
            smartcard_uart_CompleteReceiveData(base, context);
        }
    }
    /* Check if a Guard Timer rule was violated */
    if (base->IS7816 & UART_IS7816_GTV_MASK)
    { /* Clear respective interrupt status flag */
        base->IS7816 = UART_IS7816_GTV_MASK;
    }
    /* Check if a Work Wait Timer expired */
    if (base->IS7816 & UART_IS7816_WT_MASK)
    { /* Reset WWT timer */
        SMARTCARD_UART_Control(base, context, kSMARTCARD_ResetWWT, 0);
        /* Indicate WWT expired */
        context->timersState.wwtExpired = true;

        if (context->xIsBusy)
        {
            if (kSMARTCARD_Receive == context->direction)
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteReceiveData(base, context);
            }
            else
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteSendData(base, context);
            }
        }
    }
    /* Check if a Character Wait Timer expired */
    if (base->IS7816 & UART_IS7816_CWT_MASK)
    { /* Disable Character Wait Timer interrupt */
        base->IE7816 &= ~UART_IE7816_CWTE_MASK;
        /* Reset CWT timer otherwise this interrupt keeps coming */
        SMARTCARD_UART_Control(base, context, kSMARTCARD_ResetCWT, 0);
        /* Change transfer context to Idle */
        context->transferState = kSMARTCARD_IdleState;
        /* Indicate CWT expired */
        context->timersState.cwtExpired = true;

        if (context->xIsBusy)
        {
            if (kSMARTCARD_Receive == context->direction)
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteReceiveData(base, context);
            }
            else
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteSendData(base, context);
            }
        }
    }
    /* Check if a Block Wait Timer expired */
    if (base->IS7816 & UART_IS7816_BWT_MASK)
    { /* Disable Block Wait Timer interrupt */
        base->IE7816 &= ~UART_IE7816_BWTE_MASK;
        /* Reset BWT timer */
        SMARTCARD_UART_Control(base, context, kSMARTCARD_ResetBWT, 0);
        /* Indicate BWT expired */
        context->timersState.bwtExpired = true;
        /* Check if Wait Time Extension was requested */
        if (context->wtxRequested)
        {
            SMARTCARD_UART_Control(base, context, kSMARTCARD_ResetWaitTimeMultiplier, 0);
        }
        if (context->xIsBusy)
        {
            if (kSMARTCARD_Receive == context->direction)
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteReceiveData(base, context);
            }
            else
            { /* Terminate and un-block any caller */
                smartcard_uart_CompleteSendData(base, context);
            }
        }
    }
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
    /* Check if a ATR duration timer Wait Timer expired */
    if (base->IS7816 & UART_IS7816_ADT_MASK)
    { /* Clear ATR Duration Timer interrupt flag */
        base->IS7816 = UART_IS7816_ADT_MASK;
        /* Indicate ADT expired */
        context->timersState.adtExpired = true;
        /* If transfer is in progress, terminate session */
        if ((context->xIsBusy))
        {
            smartcard_uart_CompleteReceiveData(base, context);
        }
    }
#endif
    /* Clear pending interrupts */
    (void)base->S1;
    (void)base->D;
    SDK_ISR_EXIT_BARRIER;
}

/*!
 * brief Interrupt handler for UART.
 *
 * This handler uses the buffers stored in the smartcard_context_t structures to transfer
 * data. The Smart card driver requires this function to call when the UART interrupt occurs.
 *
 * param base The UART peripheral base address.
 * param context A pointer to a Smart card driver context structure.
 */
void SMARTCARD_UART_IRQHandler(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return;
    }

    /* Check if Initial Character (TS) was detected */
    if (base->IS7816 & UART_IS7816_INITD_MASK)
    {
#if defined(FSL_FEATURE_PIT_TIMER_COUNT) && (FSL_FEATURE_PIT_TIMER_COUNT)
        /* Stop TS timer */
        smartcard_uart_TimerStop(context->interfaceConfig.tsTimerId);
#endif
        /* Get Data Convention format from RXINV bit in UART_S2 register */
        context->cardParams.convention = (smartcard_card_convention_t)(base->S2 & UART_S2_RXINV_MASK);
        /* Clear interrupt flag for initial character detected */
        base->IS7816 = UART_IS7816_INITD_MASK;
        /* Disable initial character detection */
        base->IE7816 &= ~UART_IE7816_INITDE_MASK;
        /* Set transfer mode to receiving(ATR bytes) mode */
        context->transferState = kSMARTCARD_ReceivingState;
        /* Complete receive process */
        smartcard_uart_CompleteReceiveData(base, context);
        return;
    }
    /* Exit the ISR if no transfer is happening for this instance. */
    if ((!context->xIsBusy))
    {
        return;
    }

    /* RIE IRQ - count of bytes in rx fifo reached the rx threshold value RX_THD[RDT] */
    if ((base->C2 & UART_C2_RIE_MASK) && (base->S1 & UART_S1_RDRF_MASK))
    {
        if ((context->tType == kSMARTCARD_T1Transport) && (context->xSize > 1u) &&
            (base->IE7816 & UART_IE7816_BWTE_MASK))
        {
            /* Only the 1st byte has been received, now time to disable BWT interrupt and enable CWT interrupt */
            base->IE7816                    = (base->IE7816 & ~UART_IE7816_BWTE_MASK) | UART_IE7816_CWTE_MASK;
            context->timersState.cwtExpired = false;
            base->RWFIFO                    = context->rxFifoThreshold;
        }

        while ((base->RCFIFO) && (context->xSize))
        {
            /* Get data and put into receive buffer */
            *(context->xBuff) = base->D;
            ++context->xBuff;
            --context->xSize;
        }

        /* Check if the last byte was received */
        if (context->xSize == 0)
        {
            smartcard_uart_CompleteReceiveData(base, context);
        }
        else
        {
            /* If the count of remaining bytes to receive is less than fifo size, update the value of receiver data
             * threshold */
            if (context->xSize < context->rxFifoThreshold)
            {
                base->RWFIFO = context->xSize;
            }
        }
    }

    /* TCIE IRQ - all data from fifo is transmitted */
    if ((base->C2 & UART_C2_TCIE_MASK) && (base->S1 & UART_S1_TC_MASK))
    {
        smartcard_uart_CompleteSendData(base, context);
    }

