MITCHEL-Development/PEE51---AIRegelsysteem/FRDM-MCXN947/sdks/frdm_mcxn947_blank_sdk/devices/MCXN947/drivers/fsl_smartcard_uart.c
    /* TIE IRQ - tx fifo is empty */
    if ((base->C2 & UART_C2_TIE_MASK) && (base->S1 & UART_S1_TDRE_MASK))
    {
        while ((context->txFifoEntryCount - base->TCFIFO) && (context->xSize))
        {
            base->D = *(context->xBuff);
            ++context->xBuff;
            --context->xSize;
        }

        if (context->xSize == 0)
        {
            base->C2 &= ~UART_C2_TIE_MASK;
            base->C2 |= UART_C2_TCIE_MASK;
        }
    }
    SDK_ISR_EXIT_BARRIER;
}

/*!
 * @brief Configure baudrate
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 *
 * @return An error code or kStatus_SMARTCARD_Success.
 */
static status_t smartcard_uart_ConfigureBaudrate(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    uint32_t uartModuleClock;
    uint32_t instance;
    uint8_t temp;
    uint32_t brfa, sbr;
    uint32_t sourceClockInKHz = 0u;
    uint32_t sCClockInKHz     = 0u;

    instance = smartcard_uart_GetInstance(base);
    /* Get UART module clock from system clock module */
    switch (instance)
    {
        case 0u:
#if defined(UART0_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART0_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
        case 1u:
#if defined(UART1_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART1_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#if (FSL_FEATURE_SOC_UART_COUNT >= 3)
        case 2u:
#if defined(UART2_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART2_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#endif
#if (FSL_FEATURE_SOC_UART_COUNT >= 4)
        case 3u:
#if defined(UART3_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART3_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#endif
#if (FSL_FEATURE_SOC_UART_COUNT >= 5)
        case 4u:
#if defined(UART4_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART4_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#endif
#if (FSL_FEATURE_SOC_UART_COUNT >= 6)
        case 5u:
#if defined(UART5_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART5_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#endif
        default:
            uartModuleClock = 0u;
            break;
    }
    sourceClockInKHz = uartModuleClock / 1000u;
    sCClockInKHz     = context->interfaceConfig.smartCardClock / 1000u;
    /* BaudRate = (SourceClkInHz)/[16 * (SBR +  BRFA)] */
    sbr = (uint16_t)(sourceClockInKHz * context->cardParams.Fi / (context->cardParams.currentD * sCClockInKHz * 16u));
    /* check to see if sbr is out of range of register bits */
    if ((sbr > 0x1FFFu) || (sbr < 1u))
    { /* unsupported baud rate for given source clock input*/
        return kStatus_SMARTCARD_OtherError;
    }
    switch (context->cardParams.currentD)
    {
        case 1:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                sbr = sbr + SBR_CAL_ADJUST_D1_T0;
            }
            else
            {
                sbr = sbr + SBR_CAL_ADJUST_D1_T1;
            }

            break;
        }
        case 2:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                sbr = sbr + SBR_CAL_ADJUST_D2_T0;
            }
            else
            {
                sbr = sbr + SBR_CAL_ADJUST_D2_T1;
            }

            break;
        }
        case 4:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                sbr = sbr + SBR_CAL_ADJUST_D4_T0;
            }
            else
            {
                sbr = sbr + SBR_CAL_ADJUST_D4_T1;
            }

            break;
        }

        default:
            break;
    }
    base->C2 &= ~UART_C2_RE_MASK;
    temp      = base->BDH & ~UART_BDH_SBR_MASK;
    base->BDH = temp | (uint8_t)(sbr >> 8u);
    base->BDL = (uint8_t)sbr;
#if defined(FSL_FEATURE_UART_HAS_BAUD_RATE_FINE_ADJUST_SUPPORT) && (FSL_FEATURE_UART_HAS_BAUD_RATE_FINE_ADJUST_SUPPORT)
    /* determine if a fractional divider is needed to fine tune closer to the
     * desired baud, each value of brfa is in 1/32 increments,
     * hence the multiply-by-32. */
    brfa = (32u * sourceClockInKHz * context->cardParams.Fi) / (context->cardParams.currentD * sCClockInKHz * 16u);
    brfa -= (uint16_t)(32u * sbr);
    switch (context->cardParams.currentD)
    {
        case 1:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                brfa = brfa + BRFA_CAL_ADJUST_D1_T0;
            }
            else
            {
                brfa = brfa + BRFA_CAL_ADJUST_D1_T1;
            }

            break;
        }
        case 2:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                brfa = brfa + BRFA_CAL_ADJUST_D2_T0;
            }
            else
            {
                brfa = brfa + BRFA_CAL_ADJUST_D2_T1;
            }

            break;
        }
        case 4:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                brfa = brfa + BRFA_CAL_ADJUST_D4_T0;
            }
            else
            {
                brfa = (uint32_t)((int32_t)brfa + BRFA_CAL_ADJUST_D4_T1);
            }

            break;
        }

        default:
            break;
    }
    /* write the brfa value to the register*/
    temp     = base->C4 & ~UART_C4_BRFA_MASK;
    base->C4 = temp | brfa;
#endif
    base->C2 |= UART_C2_RE_MASK;

